app/controllers/cars_controller.rb

  def search
    @cars = Car.where("name like ?", "%#{params[:query]}%")
---
SELECT "cars".* FROM "cars" WHERE (name like '%civic%')

  def new
    @car = Car.new
    @parts = Part.all
    @makes = Make.all
---
SELECT "parts".* FROM "parts"
SELECT "makes".* FROM "makes"

  def edit
    @parts = Part.all
    @makes = Make.all
---
SELECT "parts".* FROM "parts"
SELECT "makes".* FROM "makes"

  def create
    @car = Car.new(car_params)

    respond_to do |format|
      if @car.save
---
INSERT INTO "cars" ("model", "make_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["model", "WRX"], ["make_id", 4], ["created_at", "2019-12-16 20:16:28.294091"], ["updated_at", "2019-12-16 20:16:28.294091"]]

  def update
    respond_to do |format|
      if @car.update(car_params)
---
UPDATE "cars" SET "make_id" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["make_id", 2], ["updated_at", "2019-12-14 01:18:53.697702"], ["id", 1]]