app/controllers/makes_controller.rb

SELECT "makes".* FROM "makes"
---
  def index
    @makes = Make.all

INSERT INTO "makes" ("name", "country", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Honda"], ["country", "Japan"], ["created_at", "2019-12-13 23:14:29.811215"], ["updated_at", "2019-12-13 23:14:29.811215"]]
---
  def create
    @make = Make.new(make_params)

    respond_to do |format|
      if @make.save

SELECT  "makes".* FROM "makes" WHERE "makes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_make
      @make = Make.find(params[:id])