app/controllers/parts_controller.rb

SELECT "cars".* FROM "cars"
---
  def new
    @part = Part.new
    @cars = Car.all

SELECT "cars".* FROM "cars"
---
  def edit
    @cars = Car.all

INSERT INTO "parts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2019-12-16 20:19:44.981937"], ["updated_at", "2019-12-16 20:19:44.981937"]]
---
  def create
    @part = Part.new(part_params)

    respond_to do |format|
      if @part.save

DELETE FROM "cars_parts" WHERE "cars_parts"."part_id" = ?  [["part_id", 13]]
DELETE FROM "parts" WHERE "parts"."id" = ?  [["id", 13]]
---
  def destroy
    @part.destroy